# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Reference implementation for the Development Containers specification
brew "devcontainer"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Plugin manager for the Fish shell
brew "fisher"
# GitHub command-line tool
brew "gh"
# Open-source GitLab command-line tool
brew "glab"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Ping, but with a graph
brew "gping"
# Tool for glamorous shell scripts
brew "gum"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Modern and intuitive terminal-based text editor
brew "micro"
# OpenShift command-line interface tools
brew "openshift-cli"
# Cross-shell prompt for astronauts
brew "starship"
# Code-search similar to ack
brew "the_silver_searcher"
# Simplified and community-driven man pages
brew "tldr"
# Write, edit, and chat about your code with AI
cask "cursor"
# Databases and SQL IDE
cask "datagrip"
# App to build and share containerised applications and microservices
cask "docker-desktop"
cask "font-caskaydia-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Java IDE by JetBrains
cask "intellij-idea"
# Clipboard manager
cask "maccy"
# Open-source software for live streaming and screen recording
cask "obs"
# Collaboration platform for API development
cask "postman"
# Screenshot measurement and annotation tool
cask "shottr"
# SSH client
cask "termius"
vscode "anysphere.remote-ssh"
vscode "castrogusttavo.min-theme"
vscode "laurenttreguier.vscode-simple-icons"
vscode "vivaxy.vscode-conventional-commits"
