jorgebucaran/fisher
jethrokuan/z
jhillyerd/plugin-git
jorgebucaran/autopair.fish
ankitsumitg/docker-fish-completions
jorgebucaran/fish-bax
blackjid/plugin-kubectl
jorgebucaran/nvm.fish
